---
kind: property
id: P:Autodesk.Revit.DB.Visual.Wave.TextureLinkTextureTransforms
source: html/ff3b0b97-9b83-e9c2-b5d2-de89b037f329.htm
---
# Autodesk.Revit.DB.Visual.Wave.TextureLinkTextureTransforms Property

The property labeled "Link Transforms" from the "Wave" schema.

## Syntax (C#)
```csharp
public static string TextureLinkTextureTransforms { get; }
```

## Remarks
This property is of type "AssetPropertyBoolean".